import React from "react";
import styled from "styled-components";
import Head from 'next/head'
export const PWraper = styled.div`
  margin-top: 80px;
  overflow: auto;
  height: calc(100vh - 80px);
  padding: 60px 40px;
  > h1 {
    text-align: center;
    padding-bottom: 20px;
  };
  > p {
    text-indent: 2rem;
  };

`

export default function PrivacyCN() {
  return <PWraper>
    <Head>
      <title>百工链存-隐私政策</title>
    </Head>
    <h1>百工隐私政策</h1>
    引言
    <p>百工是一个向广大用户提供数据存储、同步、管理和分享等的在线数据存储平台。为向您提供上述服务，我们会收集您必要的个人信息，此隐私政策旨在帮助您了解我们收集您个人信息的类型及我们如何利用和保护您的个人信息，同时我们也向您介绍了我们的隐私控制功能，您可以利用这些功能自主控制您个人信息的使用方式。</p>
    <p>百工不会收集及加密您在平台存储、分享的内容数据，仅为这些内容数据提供存储空间。本隐私政策所指的个人信息均不包括您使用存储、分享服务时的内容数据。</p>
    <p>本隐私政策适用于您通过百工的网页端、移动端、供第三方网站和应用程序使用的百工软件开发工具包（SDK）和应用程序编程接口（API）等方式来访问和使用我们的产品和服务。</p>
    <p>请您务必认真阅读本隐私政策，在确认充分了解并同意后再使用百工服务。</p>
    <p>本隐私政策将帮助您了解以下内容：</p>
    <p><a href={'#item_1'}>1. 我们如何收集和使用您的个人信息</a></p>
    <p><a href={'#item_2'}>2. 我们如何使用 Cookie 和同类技术</a></p>
    <p><a href={'#item_3'}>3. 我们如何委托处理、共享、转让、公开披露您的个人信息</a></p>
    <p><a href={'#item_4'}>4. 我们如何保存及保护您的个人信息</a></p>
    <p><a href={'#item_5'}>5. 您的权利</a></p>
    <p><a href={'#item_6'}>6. 隐私政策的修订</a></p>
    <h3 id={'item_1'}>一、 我们如何收集和使用您的个人信息</h3>
    <p>个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别您的身份或者反映您的活动情况的各种信息。 我们根据合法、正当、必要的原则，仅收集实现产品功能所必要的信息。</p>
    <p><h4>（一）您直接提供和我们自动采集的个人信息</h4></p>
    <p>1. 百工的核心业务功能</p>
    <p>百工的核心功能是实现数据云储存功能，包括数据上传、备份、管理、下载和分享。</p>
    <p>2. 百工各项功能需要收集和使用的个人信息</p>
    <p>（1）注册、登录百工和相关服务涉及的个人信息</p>
    <p>1）百工注册信息</p>
    <p>您使用百工进行数据存储和分享，您需要注册并登录百工帐号。注册百工帐号时，您至少需向我们提供邮箱；您还可以提供帐号名称、手机号码、创设帐号密码、密保问题信息，以丰富您的帐号信息，保护您的帐号安全，方便您找回帐号。</p>
    <p>（2）使用百工各项业务功能涉及的个人信息</p>
    <p>1）设备和日志信息</p>
    <p>我们的服务器会自动记录您在访问百工时所发出的请求，例如您分享的链接地址、您的分享链接被他人打开/下载的行为日志记录。您使用百工以及内容商城服务时使用过或购买过的资源名称、购买记录、浏览记录、使用记录、操作系统的版本、网络运营商的信息、您访问服务的日期、时间、时长，场景采集的个人信息：DHCP信息（可能包含：本地IP地址等）这类信息是为提供服务必须收集的基础信息。</p>
    <p><h4>（二）为您提供安全保障</h4></p>
    <p>为提高您使用我们与关联公司、合作方提供的产品和服务的安全性，我们可能使用您的信息用于身份验证、客户服务、安全防范等，以预防、发现、调查欺诈、危害安全、非法或违反与我们的协议、政策或规则的行为，以保护您、我们的其他用户、我们或关联公司、合作方及社会公众的合法权益。</p>
    <p>当我们要将信息用于本隐私政策未载明的其它用途时，会事先征求您的同意。</p>
    <p><h4>（三）事先征得授权同意的例外</h4></p>
    <p>请注意，在以下情形中，收集、使用个人信息无需事先征得您的授权同意：</p>
    <ol>
      <li> 与国家安全、国防安全直接相关的；</li>
      <li> 与公共安全、公共卫生、重大公共利益直接相关的；</li>
      <li> 与犯罪侦查、起诉、审判和判决执行等直接有关的；</li>
      <li> 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</li>
      <li> 所收集的个人信息是您自行向社会公众公开的；</li>
      <li> 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</li>
      <li> 根据您的要求签订和履行合同所必需的；</li>
      <li> 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</li>
      <li> 为开展合法的新闻报道所必需的；</li>
      <li> 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</li>
      <li> 法律法规规定的其他情形。</li>
    </ol>
    <h3 id={'item_2'}>二、我们如何使用 Cookie 和同类技术</h3>
    <p>为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。Cookie主要的功能是便于您使用网站产品和服务，以及帮助网站统计独立访客数量等。运用Cookie技术，我们能够为您提供更加周到的用户体验服务，并允许您设定您特定的服务选项。</p>
    <p>我们不会将 Cookie 用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除</p>
    <h3 id={'item_3'}>三、我们如何委托处理、共享、转让、公开披露您的个人信息</h3>
    <p><h4>（一）共享</h4></p>
    <p>除非经过您本人事先授权同意，我们不会向第三方共享、转让您的个人信息，但经过处理无法识别特定个人且不能复原的除外。</p>
    <p>1. 在下列情况下，经过您的授权同意，我们可能会共享的个人信息：</p>
    <p>（1）服务平台或服务提供商。</p>
    <p>当您使用百工接入的第三方服务时，经您授权同意，我们会将服务所必须的信息提供给第三方。</p>
    <p><h4>（二）转让</h4></p>
    <p>我们不会将您的个人信息转让给除关联公司外的任何公司、组织和个人，但以下情况除外：</p>
    <p>1. 事先获得您的明确授权或同意；</p>
    <p>2. 满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；</p>
    <p>3. 如果我们或我们的关联公司涉及合并、分立、清算、资产或业务的收购或出售等交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将确保该等信息在转移时的机密性，并尽最大可能确保新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。</p>
    <p><h4>（三）公开披露</h4></p>
    <p>我们仅会在以下情况下，公开披露您的个人信息：</p>
    <p>1. 获得您的明确同意；</p>
    <p>2. 基于法律法规、法律程序、诉讼或政府主管部门强制性要求下。</p>
    <p><h4>（四）共享、转让、公开披露个人信息时事先征得授权同意的例外</h4></p>
    <p>在以下情形中，共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：</p>
    <p>1. 与国家安全、国防安全直接相关的</p>
    <p>2. 与公共安全、公共卫生、重大公共利益直接相关的；</p>
    <p>3. 与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
    <p>4. 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
    <p>5. 个人信息主体自行向社会公众公开的个人信息；</p>
    <p>6. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p>
    <h3 id={'item_4'}>四、我们如何保存及保护您的个人信息</h3>
    <p><h4>（一）保存期限</h4></p>
    <p>您在使用百工产品及服务期间，我们将持续为您保存您的个人信息。</p>
    <p>如果您注销帐户或主动删除上述信息，我们将依据网络安全法等法律法规规定的期限内保存您的信息。在您注销帐户或主动删除上述信息后，我们不会再对您的个人信息进行商业化使用。</p>
    <p><h4>（二）安全措施</h4></p>
    <p>1. 我们会以业界成熟的安全标准和规范收集、使用、存储和传输用户信息，并通过用户协议和隐私政策告知您相关信息的使用目的和范围。</p>
    <p>2.我们会对员工进行数据安全的意识培养和安全能力的培训和考核，加强员工对于保护个人信息重要性的认识。我们会对处理个人信息的员工进行身份认证及权限控制，并会与接触您个人信息的员工签署保密协议，明确岗位职责及行为准则，确保只有授权人员才可访问个人信息。</p>
    <p>3. 我们提醒您注意，互联网并非绝对安全的环境，当您通过社交软件与其他用户交互信息时，不确定第三方软件对信息的传递是否完全加密，请注意确保您个人信息的安全，我们建议您不要通过此类方式发送个人信息，以免个人信息泄露。请对您账户内的数据自行加密，协助我们保证您的帐号以及个人信息安全。</p>
    <p>4. 我们也请您理解，在互联网行业由于技术的限制和飞速发展以及可能存在的各种恶意攻击手段，即便我们竭尽所能加强安全措施，也不可能始终保证信息的百分之百安全。请您了解，您使用我们的产品和/或服务时所用的系统和通讯网络，有可能在我们控制之外的其他环节而出现安全问题。</p>
    <h3 id={'item_5'}>五、您的权利</h3>
    <p>按照相关的法律、法规、标准，我们保障您对自己的个人信息行使以下权利：</p>
    <p><h4>（一）访问、变更您的个人信息</h4></p>
    <p>您可以通过如下方式访问您的个人信息：</p>
    <p>1.访问、变更帐户信息：</p>
    <p>您可以登录我们的网站，访问、变更您的帐户信息（包括但不限于手机号码、邮箱等）。</p>
    <p>当您发现我们处理的关于您的个人信息有错误时，您有权对错误或不完整的信息作出更正，经对您的身份进行验证后，您可以自行在百工内进行更正，或通过反馈与报错等将您的更正申请提交给我们。</p>
    <p><h4>（二）改变您授权同意的范围</h4></p>
    <p>您可以随时给予或收回您的授权同意。</p>
    <p>当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也将不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的同意或授权而开展的个人信息处理。</p>
    <p><h4>（三）提前获知产品和服务停止运营权</h4></p>
    <p>若因特殊原因导致百工O产品和服务被迫停止运营，我们将在产品或服务的主页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。</p>
    <h3 id={'item_6'}>六、隐私政策的修订</h3>
    <p>我们的隐私政策可能变更。</p>
    <p>未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本隐私政策所做的任何变更，建议您在联网的状态下查询最新版本的隐私政策。</p>
    <p>对于重大变更，我们会在产品或服务的主要曝光页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您。若您不同意该等变更可以停止使用百工产品和服务，若您继续使用我们的产品和/或服务，即表示您同意受修订后的本隐私政策的约束。</p>
    <p>本政策所指的重大变更包括但不限于：</p>
    <p>1. 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
    <p>2. 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
    <p>3. 个人信息共享、转让或公开披露的主要对象发生变化；</p>
    <p>4. 您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
    <p>5. 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
    <p>6. 个人信息安全影响评估报告表明存在高风险时。</p>
  </PWraper>
}
